nicolas5000/io-rts-esp32/sdkconfig.defaults.lilygo_lora32
# sdkconfig.defaults.lilygo_lora32
# Board-specific overrides for the LilyGo Lora32 T3 v1.6.1 (ESP32) with SX1276 radio.
# Committed to git — contains NO secrets (no WiFi credentials, MQTT passwords, OTA keys, etc.).
# Build: idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.lilygo_lora32" build

# Target chip
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0xf000

# Console — ESP32 uses hardware UART0, not USB Serial/JTAG (which is S3-only)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# SPI bus for SX1276 LoRa radio (SPI_HOST2)
CONFIG_SPI_HOST2_SCK=5
CONFIG_SPI_HOST2_MOSI=27
CONFIG_SPI_HOST2_MISO=19

# SX1276 control pins
CONFIG_IOHOMECONTROL_SX1276_SPI_HOST2=y
CONFIG_IOHOMECONTROL_SX1276_SPI_CS=18
CONFIG_IOHOMECONTROL_SX1276_RST=14
CONFIG_IOHOMECONTROL_SX1276_DIO0=26
CONFIG_IOHOMECONTROL_SX1276_DIO2=32
CONFIG_IOHOMECONTROL_SX1276_DIO4=-1

# OLED display (SSD1306 on I2C)
CONFIG_OLED_ENABLED=y
CONFIG_OLED_SDA_GPIO=21
CONFIG_OLED_SCL_GPIO=22
CONFIG_OLED_RST_GPIO=-1
CONFIG_OLED_I2C_ADDR=0x3C
CONFIG_OLED_I2C_FREQ_HZ=400000

# WiFi reset button — GPIO0 is the BOOT button on T3S3
CONFIG_WIFI_RESET_GPIO=0
CONFIG_WIFI_RESET_GPIO_HOLD_S=5

# Application features
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_WEB_ENABLED=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y


CONFIG_BOARD_NAME="lilygo-lora32"
